app/controllers/pages_controller.rb

  def create
    @page = Page.new(params[:page])
    respond_to do |format|
      if @page.save
---
INSERT INTO `pages` (`created_at`, `title`, `body`, `updated_at`, `cached_slug`) VALUES('2010-08-12 19:10:14', 'This is a page', 'This is its body', '2010-08-12 19:10:14', NULL)

  def index
    @pages = Page.paginate(:page => params[:page], :per_page => PAGES_PER_PAGE)
---
SELECT * FROM `pages` LIMIT 0, 50

  def find_page
    @page = Page.find(params[:id]) if params[:id]
---
SELECT * FROM `pages` WHERE (`pages`.`id` = 1)